In [124]:
import pandas as pd
import numpy as np

In [125]:
# Create and Inspect: Create a DataFrame from the data dictionary. Print the specific shape of the DataFrame (rows, columns) and show the data types of all columns.
data = {
        "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"],
    "Age": [25, 30, 35, 40, 22, 28, 45],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio"],
    "Salary": [70000, 80000, 120000, 90000, 60000, 75000, 110000]
}
df = pd.DataFrame(data)
data
print(df.shape)
print(df.dtypes)

(7, 4)
Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [126]:
# Custom Index creation: Create a new DataFrame df_custom from data but set the index to be specific IDs: ['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7'].# Custom Index creation: Create a new DataFrame df_custom from data but set the index to be specific IDs: ['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7'].
df_custom = df.copy()
df_custom.index = ['ID1', 'ID2', 'ID3', 'ID4', 'ID5', 'ID6', 'ID7']
print("\nCustom Index:\n", df_custom)

Custom Index:
         Name  Age          City  Salary
ID1    Alice   25      New York   70000
ID2      Bob   30   Los Angeles   80000
ID3  Charlie   35       Chicago  120000
ID4    David   40       Houston   90000
ID5      Eva   22       Phoenix   60000
ID6    Frank   28  Philadelphia   75000
ID7    Grace   45   San Antonio  110000

In [127]:

# Column Selection: Create a new DataFrame df_subset containing only the "Name" and "Salary" columns from df.
df_subset = df[["Name", "Salary"]]
print(df_subset)

      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie  120000
3    David   90000
4      Eva   60000
5    Frank   75000
6    Grace  110000

In [128]:

# Row Slicing (Integer): Use iloc to select rows 2 through 5 (inclusive of index 2, exclusive of 5 depending on slice logic, or just indices 2,3,4) and all columns.
print( df.iloc[2:5])

      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston   90000
4      Eva   22  Phoenix   60000

In [129]:
# Row and Column Slicing (Label): Use loc to select the "Name" and "Age" for the rows with index labels 1, 3, and 5.
print(df.loc[[1, 3, 5], ["Name", "Age"]])

    Name  Age
1    Bob   30
3  David   40
5  Frank   28

In [130]:
# Cell Access: Use iloc to print the "City" of the 4th row (index 3).
print( df.iloc[3]["City"])

Houston

In [131]:

# Head and Tail: Print the first 3 rows and the last 2 rows of the DataFrame in a single script execution.
print(df.head(3))
print(df.tail(2))

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
    Name  Age          City  Salary
5  Frank   28  Philadelphia   75000
6  Grace   45   San Antonio  110000

In [132]:
# Describe Objects: Use df.describe() but try to include all columns (including objects like strings), not just numbers. (Hint: look up include='all' or check dtypes).
print(df.describe(include="all"))

         Name        Age      City         Salary
count       7   7.000000         7       7.000000
unique      7        NaN         7            NaN
top     Alice        NaN  New York            NaN
freq        1        NaN         1            NaN
mean      NaN  32.142857       NaN   86428.571429
std       NaN   8.275034       NaN   21739.803302
min       NaN  22.000000       NaN   60000.000000
25%       NaN  26.500000       NaN   72500.000000
50%       NaN  30.000000       NaN   80000.000000
75%       NaN  37.500000       NaN  100000.000000
max       NaN  45.000000       NaN  120000.000000

In [133]:


# Rename Single: Rename the "Salary" column to "Annual Income" in place (or reassign to df).
df.rename(columns={"Salary": "Annual Income"}, inplace=True)
df

      Name  Age          City  Annual Income
0    Alice   25      New York          70000
1      Bob   30   Los Angeles          80000
2  Charlie   35       Chicago         120000
3    David   40       Houston          90000
4      Eva   22       Phoenix          60000
5    Frank   28  Philadelphia          75000
6    Grace   45   San Antonio         110000

In [134]:
# Rename Multiple: Rename "Name" to "Full Name" and "City" to "Location" simultaneously.
df.rename(columns={"Name": "Full Name", "City": "Location"}, inplace=True)
df

  Full Name  Age      Location  Annual Income
0     Alice   25      New York          70000
1       Bob   30   Los Angeles          80000
2   Charlie   35       Chicago         120000
3     David   40       Houston          90000
4       Eva   22       Phoenix          60000
5     Frank   28  Philadelphia          75000
6     Grace   45   San Antonio         110000

In [135]:
# Drop Column: Remove the "City" column from the DataFrame.
data = {
        "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"],
    "Age": [25, 30, 35, 40, 22, 28, 45],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio"],
    "Salary": [70000, 80000, 120000, 90000, 60000, 75000, 110000]
}
df = pd.DataFrame(data)
df.drop(columns=["City"], inplace=True)
df

      Name  Age  Salary
0    Alice   25   70000
1      Bob   30   80000
2  Charlie   35  120000
3    David   40   90000
4      Eva   22   60000
5    Frank   28   75000
6    Grace   45  110000

In [136]:
# Drop Row: Remove the row at index 3.
df.drop(index=3, inplace=True)
print(df)

      Name  Age  Salary
0    Alice   25   70000
1      Bob   30   80000
2  Charlie   35  120000
4      Eva   22   60000
5    Frank   28   75000
6    Grace   45  110000

In [137]:
# Add Constant Column: Add a new column "Country" and populate it with "USA" for all rows.
df["Country"] = "USA"
df

      Name  Age  Salary Country
0    Alice   25   70000     USA
1      Bob   30   80000     USA
2  Charlie   35  120000     USA
4      Eva   22   60000     USA
5    Frank   28   75000     USA
6    Grace   45  110000     USA

In [138]:
# Add Calculated Column (Born Year): Assuming the current year is 2025, create a new column "Birth Year" by subtracting "Age" from 2025.
df["Birth Year"] = 2025 - df["Age"]
df

      Name  Age  Salary Country  Birth Year
0    Alice   25   70000     USA        2000
1      Bob   30   80000     USA        1995
2  Charlie   35  120000     USA        1990
4      Eva   22   60000     USA        2003
5    Frank   28   75000     USA        1997
6    Grace   45  110000     USA        1980

In [139]:
# Add List Column: Add a new column "Department" using this list: ['HR', 'Eng', 'Eng', 'Sales', 'HR', 'Sales', 'Admin']
df["Department"] = ['HR', 'Eng', 'Eng', 'HR', 'Sales', 'Admin']
print(df)

      Name  Age  Salary Country  Birth Year Department
0    Alice   25   70000     USA        2000         HR
1      Bob   30   80000     USA        1995        Eng
2  Charlie   35  120000     USA        1990        Eng
4      Eva   22   60000     USA        2003         HR
5    Frank   28   75000     USA        1997      Sales
6    Grace   45  110000     USA        1980      Admin

In [140]:
# Numpy conversion: Convert the underlying data of the DataFrame to a NumPy array and print it.
np_array = df.to_numpy()
print(np_array)

[['Alice' 25 70000 'USA' 2000 'HR']
 ['Bob' 30 80000 'USA' 1995 'Eng']
 ['Charlie' 35 120000 'USA' 1990 'Eng']
 ['Eva' 22 60000 'USA' 2003 'HR']
 ['Frank' 28 75000 'USA' 1997 'Sales']
 ['Grace' 45 110000 'USA' 1980 'Admin']]

In [141]:
# Empty DataFrame: Create an empty DataFrame. Then add two columns "A" and "B" with 3 values each.
df_empty = pd.DataFrame()
df_empty["A"] = [1, 2, 3]
df_empty["B"] = [4, 5, 6]
print(df_empty)

   A  B
0  1  4
1  2  5
2  3  6

In [142]:
# Reorder Columns: Rearrange the columns so that "Age" appears before "Name".
cols = list(df.columns)
cols.insert(0, cols.pop(cols.index("Age")))
df = df[cols]
print(df)

   Age     Name  Salary Country  Birth Year Department
0   25    Alice   70000     USA        2000         HR
1   30      Bob   80000     USA        1995        Eng
2   35  Charlie  120000     USA        1990        Eng
4   22      Eva   60000     USA        2003         HR
5   28    Frank   75000     USA        1997      Sales
6   45    Grace  110000     USA        1980      Admin

In [143]:
# Conditional Update (Manual): Update the "Age" of "Alice" (index 0) to 26 using at or loc.
df.loc[0, "Age"] = 26
df

   Age     Name  Salary Country  Birth Year Department
0   26    Alice   70000     USA        2000         HR
1   30      Bob   80000     USA        1995        Eng
2   35  Charlie  120000     USA        1990        Eng
4   22      Eva   60000     USA        2003         HR
5   28    Frank   75000     USA        1997      Sales
6   45    Grace  110000     USA        1980      Admin

In [152]:
# Random Sample: specificy a random seed (optional) and select a random sample of 3 rows from the DataFrame.
df_random = df.sample(3)
df_random

   Age   Name  Salary Country  Birth Year Department
4   22    Eva   60000     USA        2003         HR
5   28  Frank   75000     USA        1997      Sales
0   26  Alice   70000     USA        2000         HR